Revit 2027 API
BuiltInFailures.RebarSystemFailures.LessThanTwoBars Property
 Each reinforcement direction requires at least 2 bars. Please increase the number of bars.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LessThanTwoBars { get; }
Public Shared ReadOnly Property LessThanTwoBars As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LessThanTwoBars {
	FailureDefinitionId^ get ();
}
static member LessThanTwoBars : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace